##Задача №1. Решение в группах
##Семинар 1. Ввод-вывод, операторы ветвления
##За день машина проезжает n километров. Сколько
##дней нужно, чтобы проехать маршрут длиной m
##километров? При решении этой задачи нельзя
##пользоваться условной инструкцией if и циклами.

n= 200
m= 1100
a= (m/n)
print(a, m%n)